{
  "Apple___Apple_scab": {
    "Description": "A fungal disease that causes olive-green to black spots on leaves, fruit, and stems. Symptoms often start as small, light-colored spots that gradually darken.",
    "Diagnosis": "Fungal disease identified by dark, velvety lesions on leaves and fruit. Can be confused with sooty blotch, which lacks the defined lesions.",
    "Recommended_Action": "Apply fungicides and prune infected areas. For severe cases, consider removing heavily infected trees.",
    "Treatment": "Fungicides such as myclobutanil or captan. Consider organic options like sulfur for early intervention.",
    "Treatment_Timing": "Apply at bud break and continue through the growing season, especially before wet periods.",
    "Prevention": "Plant resistant varieties, remove fallen leaves and fruit from the orchard, and improve air circulation by pruning.",
    "Monitoring": "Regularly inspect for the first signs of scab in early spring. Pay special attention during wet, cool weather. Implement IPM strategies like scouting and applying fungicides only when necessary.",
    "Cultural_Practices": "Practice crop rotation and proper spacing to prevent the buildup of the disease. Use drip irrigation instead of overhead watering to keep foliage dry.",
    "Physical_Controls": "Mulch around trees to prevent soil splash. Use row covers to protect young plants from spore contamination.",
    "Biological_Controls": "Introduce beneficial fungi or bacteria that can outcompete the scab pathogen."
  },
  "Apple___Black_rot": {
    "Description": "A fungal disease that causes black, sunken lesions on apple fruit and leaf spots.",
    "Diagnosis": "Identified by black, circular lesions on fruit and purplish leaf spots. Can be confused with apple scab.",
    "Recommended_Action": "Remove infected fruit and prune diseased branches. Apply fungicides if necessary.",
    "Treatment": "Fungicides such as captan or thiophanate-methyl.",
    "Treatment_Timing": "Apply during early fruit development and continue as needed.",
    "Prevention": "Prune trees to improve air circulation and remove any mummified fruit from the tree and ground.",
    "Monitoring": "Inspect trees regularly during the growing season for signs of black rot, especially after rainy periods.",
    "Cultural_Practices": "Plant resistant varieties and practice good orchard sanitation by removing infected fruit and leaves.",
    "Physical_Controls": "Use mulching to prevent soil splash and row covers to protect young fruit from spore contamination.",
    "Biological_Controls": "Encourage beneficial organisms like Trichoderma species that suppress black rot fungi."
  },
  "Apple___Cedar_apple_rust": {
    "Description": "A fungal disease causing bright orange spots on apple leaves and fruit, spread by nearby cedar trees.",
    "Diagnosis": "Bright orange, rust-like spots on leaves and fruit. Usually linked to the presence of cedar trees nearby.",
    "Recommended_Action": "Apply fungicides and remove nearby cedar trees if possible.",
    "Treatment": "Fungicides like myclobutanil or sulfur.",
    "Treatment_Timing": "Apply before symptoms appear, particularly during wet weather in the spring.",
    "Prevention": "Plant resistant apple varieties and maintain a distance between apple trees and cedars.",
    "Monitoring": "Regularly inspect apple trees, especially in the spring, for early signs of rust.",
    "Cultural_Practices": "Remove cedar trees within a few hundred meters of the apple orchard to break the disease cycle.",
    "Physical_Controls": "Use physical barriers like row covers to protect young trees during critical infection periods.",
    "Biological_Controls": "Introduce beneficial fungi that can help outcompete rust pathogens."
  },
  "Apple___healthy": {
    "Description": "No visible signs of disease or pest damage.",
    "Diagnosis": "Plant is healthy with no visible signs of disease or pest damage.",
    "Recommended_Action": "No chemical action required.",
    "Treatment": "Maintain cultural practices such as regular watering, proper fertilization, and pruning.",
    "Treatment_Timing": "N/A",
    "Prevention": "Continue regular maintenance and monitoring. Use crop rotation and companion planting to prevent potential issues.",
    "Monitoring": "Conduct regular checks for any signs of disease or pest activity. Maintain a healthy environment by removing weeds and keeping the orchard clean.",
    "Cultural_Practices": "Practice crop rotation and maintain proper spacing to reduce disease risk.",
    "Physical_Controls": "Use mulching to retain soil moisture and suppress weeds.",
    "Biological_Controls": "Encourage beneficial insects and soil organisms to support plant health."
  },
  "Background_without_leaves": {
    "Description": "Non-plant background images, typically used to distinguish between plant and non-plant areas.",
    "Diagnosis": "N/A",
    "Recommended_Action": "N/A",
    "Treatment": "N/A",
    "Treatment_Timing": "N/A",
    "Prevention": "N/A",
    "Monitoring": "N/A",
    "Cultural_Practices": "N/A",
    "Physical_Controls": "N/A",
    "Biological_Controls": "N/A"
  },
  "Blueberry___healthy": {
    "Description": "No visible signs of disease or pest damage.",
    "Diagnosis": "Plant is healthy with no visible signs of disease or pest damage.",
    "Recommended_Action": "No chemical action required.",
    "Treatment": "Maintain cultural practices such as regular watering, proper fertilization, and pruning.",
    "Treatment_Timing": "N/A",
    "Prevention": "Continue regular maintenance and monitoring. Use crop rotation and companion planting to prevent potential issues.",
    "Monitoring": "Conduct regular checks for any signs of disease or pest activity. Maintain a healthy environment by removing weeds and keeping the garden clean.",
    "Cultural_Practices": "Practice crop rotation and proper spacing to reduce disease risk.",
    "Physical_Controls": "Use mulching to retain soil moisture and suppress weeds.",
    "Biological_Controls": "Encourage beneficial insects and soil organisms to support plant health."
  },
  "Cherry___Powdery_mildew": {
    "Description": "A fungal disease that causes white, powdery spots on leaves, stems, and fruit.",
    "Diagnosis": "Identified by white, powdery spots on the surface of leaves and other plant parts.",
    "Recommended_Action": "Apply fungicides if necessary and prune affected areas.",
    "Treatment": "Fungicides such as sulfur or potassium bicarbonate. Consider organic options like neem oil.",
    "Treatment_Timing": "Apply at the first sign of disease and continue as needed during the growing season.",
    "Prevention": "Improve air circulation around plants and avoid overhead watering.",
    "Monitoring": "Regularly inspect leaves, particularly in humid conditions, for early signs of powdery mildew.",
    "Cultural_Practices": "Ensure proper spacing between plants to improve air circulation. Water at the base of the plant rather than overhead.",
    "Physical_Controls": "Prune infected leaves and remove them from the area to prevent the spread of spores.",
    "Biological_Controls": "Introduce beneficial organisms like Bacillus subtilis that help control powdery mildew."
  },
  "Cherry___healthy": {
    "Description": "No visible signs of disease or pest damage.",
    "Diagnosis": "Plant is healthy with no visible signs of disease or pest damage.",
    "Recommended_Action": "No chemical action required.",
    "Treatment": "Maintain cultural practices such as regular watering, proper fertilization, and pruning.",
    "Treatment_Timing": "N/A",
    "Prevention": "Continue regular maintenance and monitoring. Use crop rotation and companion planting to prevent potential issues.",
    "Monitoring": "Conduct regular checks for any signs of disease or pest activity. Maintain a healthy environment by removing weeds and keeping the garden clean.",
    "Cultural_Practices": "Practice crop rotation and proper spacing to reduce disease risk.",
    "Physical_Controls": "Use mulching to retain soil moisture and suppress weeds.",
    "Biological_Controls": "Encourage beneficial insects and soil organisms to support plant health."
  },
  "Corn___Cercospora_leaf_spot Gray_leaf_spot": {
    "Description": "A fungal disease that causes small, grayish spots on corn leaves, which can merge into larger lesions.",
    "Diagnosis": "Grayish, rectangular lesions on the leaves, which may coalesce and lead to premature leaf death.",
    "Recommended_Action": "Apply fungicides if the infection is severe and threatens yield.",
    "Treatment": "Fungicides such as strobilurins or triazoles.",
    "Treatment_Timing": "Apply at the onset of symptoms, particularly in humid conditions.",
    "Prevention": "Rotate crops to reduce disease pressure and plant resistant varieties.",
    "Monitoring": "Regularly inspect corn leaves during the growing season, especially in wet, humid weather.",
    "Cultural_Practices": "Practice crop rotation and plant resistant varieties to reduce disease incidence.",
    "Physical_Controls": "Remove and destroy infected plant debris to reduce the spread of spores.",
    "Biological_Controls": "Introduce beneficial fungi that can outcompete Cercospora pathogens."
  },
  "Corn___Common_rust": {
    "Description": "A fungal disease causing reddish-brown pustules on corn leaves, which can reduce photosynthesis and yield.",
    "Diagnosis": "Reddish-brown, raised pustules on both upper and lower leaf surfaces. Common rust can be confused with southern rust, which is more yellowish.",
    "Recommended_Action": "Apply fungicides if the infection is severe, particularly during early growth stages.",
    "Treatment": "Fungicides such as mancozeb or propiconazole.",
    "Treatment_Timing": "Apply at the first sign of rust and continue as needed during humid weather.",
    "Prevention": "Plant rust-resistant varieties and practice crop rotation.",
    "Monitoring": "Inspect corn leaves regularly, especially in humid or wet conditions.",
    "Cultural_Practices": "Plant resistant varieties and rotate crops to reduce disease pressure.",
    "Physical_Controls": "Remove infected leaves and other plant debris to prevent the spread of spores.",
    "Biological_Controls": "Encourage beneficial fungi that help control rust pathogens."
  },
  "Corn___Northern_Leaf_Blight": {
    "Description": "A fungal disease that causes long, grayish-green lesions on corn leaves, which can coalesce and cause significant yield loss.",
    "Diagnosis": "Long, elliptical grayish-green lesions on the leaves. Often more severe in humid conditions.",
    "Recommended_Action": "Apply fungicides if necessary, especially during periods of high humidity.",
    "Treatment": "Fungicides such as azoxystrobin or propiconazole.",
    "Treatment_Timing": "Apply at the onset of symptoms, particularly in humid conditions.",
    "Prevention": "Plant resistant varieties and rotate crops to reduce disease pressure.",
    "Monitoring": "Regularly inspect corn fields for early signs of blight, especially in humid weather.",
    "Cultural_Practices": "Rotate crops and plant resistant varieties. Ensure proper field sanitation by removing plant debris.",
    "Physical_Controls": "Remove infected leaves and destroy them to reduce the spread of spores.",
    "Biological_Controls": "Use beneficial fungi like Trichoderma species to suppress blight pathogens."
  },
  "Corn___healthy": {
    "Description": "No visible signs of disease or pest damage.",
    "Diagnosis": "Plant is healthy with no visible signs of disease or pest damage.",
    "Recommended_Action": "No chemical action required.",
    "Treatment": "Maintain cultural practices such as regular watering, proper fertilization, and pruning.",
    "Treatment_Timing": "N/A",
    "Prevention": "Continue regular maintenance and monitoring. Use crop rotation and companion planting to prevent potential issues.",
    "Monitoring": "Conduct regular checks for any signs of disease or pest activity. Maintain a healthy environment by removing weeds and keeping the field clean.",
    "Cultural_Practices": "Practice crop rotation and proper spacing to reduce disease risk.",
    "Physical_Controls": "Use mulching to retain soil moisture and suppress weeds.",
    "Biological_Controls": "Encourage beneficial insects and soil organisms to support plant health."
  },
  "Grape___Black_rot": {
    "Description": "A fungal disease that causes black, sunken lesions on grape leaves, stems, and fruit.",
    "Diagnosis": "Black, circular lesions on leaves and fruit. Can lead to shriveled, mummified fruit.",
    "Recommended_Action": "Remove and destroy infected fruit and apply fungicides if necessary.",
    "Treatment": "Fungicides such as mancozeb or myclobutanil.",
    "Treatment_Timing": "Apply at the onset of symptoms and during humid weather.",
    "Prevention": "Prune vines to improve air circulation and remove any mummified fruit from the vines and ground.",
    "Monitoring": "Inspect grapevines regularly during the growing season for signs of black rot, especially after rainy periods.",
    "Cultural_Practices": "Practice good vineyard sanitation by removing infected fruit and pruning to improve air circulation.",
    "Physical_Controls": "Use mulching to prevent soil splash and row covers to protect young grapes from spore contamination.",
    "Biological_Controls": "Introduce beneficial fungi like Trichoderma species that suppress black rot."
  },
  "Grape___Esca_(Black_Measles)": {
    "Description": "A complex fungal disease that causes black streaks on grapevine leaves and fruit, leading to vine decline.",
    "Diagnosis": "Black streaks or spots on leaves and fruit. Vine wood may show dark streaks when cut.",
    "Recommended_Action": "Remove infected vines and apply fungicides if necessary.",
    "Treatment": "Fungicides such as myclobutanil or tebuconazole.",
    "Treatment_Timing": "Apply during early stages of infection, particularly in spring.",
    "Prevention": "Prune vines to improve air circulation and remove infected wood.",
    "Monitoring": "Inspect vines regularly for early signs of Esca, especially in older vines.",
    "Cultural_Practices": "Practice proper pruning and vineyard sanitation to reduce disease spread.",
    "Physical_Controls": "Use physical barriers like row covers to protect young vines during critical infection periods.",
    "Biological_Controls": "Encourage beneficial soil organisms that help suppress Esca pathogens."
  },
  "Grape___Leaf_blight_(Isariopsis_Leaf_Spot)": {
    "Description": "A fungal disease that causes small, dark spots on grape leaves, which can merge into larger lesions.",
    "Diagnosis": "Small, circular, dark spots on the leaves, which may merge into larger areas of blight.",
    "Recommended_Action": "Apply fungicides if necessary and prune affected areas.",
    "Treatment": "Fungicides such as copper-based products or sulfur.",
    "Treatment_Timing": "Apply at the first sign of disease and continue as needed during the growing season.",
    "Prevention": "Prune vines to improve air circulation and avoid overhead watering.",
    "Monitoring": "Regularly inspect leaves, particularly in humid conditions, for early signs of blight.",
    "Cultural_Practices": "Ensure proper spacing and pruning to improve air circulation. Avoid overhead watering.",
    "Physical_Controls": "Prune infected leaves and remove them from the area to prevent the spread of spores.",
    "Biological_Controls": "Introduce beneficial organisms like Bacillus subtilis that help control leaf blight."
  },
  "Grape___healthy": {
    "Description": "No visible signs of disease or pest damage.",
    "Diagnosis": "Plant is healthy with no visible signs of disease or pest damage.",
    "Recommended_Action": "No chemical action required.",
    "Treatment": "Maintain cultural practices such as regular watering, proper fertilization, and pruning.",
    "Treatment_Timing": "N/A",
    "Prevention": "Continue regular maintenance and monitoring. Use crop rotation and companion planting to prevent potential issues.",
    "Monitoring": "Conduct regular checks for any signs of disease or pest activity. Maintain a healthy environment by removing weeds and keeping the vineyard clean.",
    "Cultural_Practices": "Practice crop rotation and proper spacing to reduce disease risk.",
    "Physical_Controls": "Use mulching to retain soil moisture and suppress weeds.",
    "Biological_Controls": "Encourage beneficial insects and soil organisms to support plant health."
  },
  "Orange___Haunglongbing_(Citrus_greening)": {
    "Description": "A bacterial disease that causes yellowing of citrus leaves and misshapen, bitter fruit.",
    "Diagnosis": "Yellowing of leaves with blotchy, uneven patterns. Fruit may be misshapen and bitter.",
    "Recommended_Action": "Remove and destroy infected trees and control the psyllid vector.",
    "Treatment": "No effective chemical treatment available. Focus on prevention and control.",
    "Treatment_Timing": "N/A",
    "Prevention": "Control the psyllid vector with insecticides and remove infected trees to prevent disease spread.",
    "Monitoring": "Inspect citrus trees regularly for early signs of greening, especially in areas with known psyllid populations.",
    "Cultural_Practices": "Plant resistant varieties and practice good orchard sanitation by removing infected trees.",
    "Physical_Controls": "Use row covers to protect young trees from psyllid infestation.",
    "Biological_Controls": "Encourage natural predators of psyllids, such as ladybugs, to control vector populations."
  },
  "Peach___Bacterial_spot": {
    "Description": "A bacterial disease that causes small, dark spots on peach leaves and fruit, leading to defoliation and fruit drop.",
    "Diagnosis": "Small, dark, angular spots on leaves and fruit. Leaves may turn yellow and drop prematurely.",
    "Recommended_Action": "Apply copper-based bactericides and prune affected areas.",
    "Treatment": "Copper-based bactericides or antibiotics like streptomycin.",
    "Treatment_Timing": "Apply during early stages of infection, particularly during wet weather.",
    "Prevention": "Plant resistant varieties and avoid overhead watering.",
    "Monitoring": "Inspect peach trees regularly for early signs of bacterial spot, especially after rainy periods.",
    "Cultural_Practices": "Practice good orchard sanitation by removing infected leaves and fruit. Ensure proper spacing and pruning to improve air circulation.",
    "Physical_Controls": "Prune infected leaves and remove them from the area to prevent the spread of bacteria.",
    "Biological_Controls": "Introduce beneficial bacteria that can outcompete the bacterial spot pathogen."
  },
  "Peach___healthy": {
    "Description": "No visible signs of disease or pest damage.",
    "Diagnosis": "Plant is healthy with no visible signs of disease or pest damage.",
    "Recommended_Action": "No chemical action required.",
    "Treatment": "Maintain cultural practices such as regular watering, proper fertilization, and pruning.",
    "Treatment_Timing": "N/A",
    "Prevention": "Continue regular maintenance and monitoring. Use crop rotation and companion planting to prevent potential issues.",
    "Monitoring": "Conduct regular checks for any signs of disease or pest activity. Maintain a healthy environment by removing weeds and keeping the orchard clean.",
    "Cultural_Practices": "Practice crop rotation and proper spacing to reduce disease risk.",
    "Physical_Controls": "Use mulching to retain soil moisture and suppress weeds.",
    "Biological_Controls": "Encourage beneficial insects and soil organisms to support plant health."
  },
  "Pepper,_bell___Bacterial_spot": {
    "Description": "A bacterial disease that causes dark, water-soaked spots on pepper leaves and fruit, leading to defoliation and fruit drop.",
    "Diagnosis": "Dark, water-soaked spots on leaves and fruit. Leaves may turn yellow and drop prematurely.",
    "Recommended_Action": "Apply copper-based bactericides and avoid overhead watering.",
    "Treatment": "Copper-based bactericides or antibiotics like streptomycin.",
    "Treatment_Timing": "Apply during early stages of infection, particularly during wet weather.",
    "Prevention": "Plant resistant varieties and practice good garden sanitation.",
    "Monitoring": "Inspect pepper plants regularly for early signs of bacterial spot, especially after rainy periods.",
    "Cultural_Practices": "Avoid overhead watering and practice proper spacing to improve air circulation. Remove and destroy infected plant material.",
    "Physical_Controls": "Remove and destroy infected leaves and fruit to prevent the spread of bacteria.",
    "Biological_Controls": "Introduce beneficial bacteria that can outcompete the bacterial spot pathogen."
  },
  "Pepper,_bell___healthy": {
    "Description": "No visible signs of disease or pest damage.",
    "Diagnosis": "Plant is healthy with no visible signs of disease or pest damage.",
    "Recommended_Action": "No chemical action required.",
    "Treatment": "Maintain cultural practices such as regular watering, proper fertilization, and pruning.",
    "Treatment_Timing": "N/A",
    "Prevention": "Continue regular maintenance and monitoring. Use crop rotation and companion planting to prevent potential issues.",
    "Monitoring": "Conduct regular checks for any signs of disease or pest activity. Maintain a healthy environment by removing weeds and keeping the garden clean.",
    "Cultural_Practices": "Practice crop rotation and proper spacing to reduce disease risk.",
    "Physical_Controls": "Use mulching to retain soil moisture and suppress weeds.",
    "Biological_Controls": "Encourage beneficial insects and soil organisms to support plant health."
  },
  "Potato___Early_blight": {
    "Description": "A fungal disease that causes dark, concentric spots on potato leaves, leading to leaf blight and reduced yields.",
    "Diagnosis": "Dark, concentric spots on older leaves, leading to leaf blight.",
    "Recommended_Action": "Apply fungicides if necessary, especially during wet weather.",
    "Treatment": "Fungicides such as chlorothalonil or mancozeb.",
    "Treatment_Timing": "Apply at the first sign of disease and continue during wet conditions.",
    "Prevention": "Plant resistant varieties and practice crop rotation.",
    "Monitoring": "Inspect potato plants regularly for early signs of blight, especially in wet weather.",
    "Cultural_Practices": "Practice crop rotation and proper spacing to reduce disease risk.",
    "Physical_Controls": "Remove infected leaves and destroy them to prevent the spread of spores.",
    "Biological_Controls": "Introduce beneficial fungi like Trichoderma species to suppress blight pathogens."
  },
  "Potato___Late_blight": {
    "Description": "A serious fungal disease that causes dark, water-soaked lesions on potato leaves and tubers, leading to rapid plant death.",
    "Diagnosis": "Dark, water-soaked lesions on leaves and tubers, often with a white fungal growth on the undersides of leaves.",
    "Recommended_Action": "Apply fungicides immediately if blight is detected.",
    "Treatment": "Fungicides such as mancozeb or chlorothalonil.",
    "Treatment_Timing": "Apply at the first sign of disease and continue during wet weather.",
    "Prevention": "Plant resistant varieties and ensure good drainage.",
    "Monitoring": "Regularly inspect potato plants, especially after wet weather, for signs of late blight.",
    "Cultural_Practices": "Plant resistant varieties and practice crop rotation to reduce disease pressure.",
    "Physical_Controls": "Remove and destroy infected plants to prevent the spread of the disease.",
    "Biological_Controls": "Use beneficial microorganisms like Bacillus subtilis to help control blight."
  },
  "Potato___healthy": {
    "Description": "No visible signs of disease or pest damage.",
    "Diagnosis": "Plant is healthy with no visible signs of disease or pest damage.",
    "Recommended_Action": "No chemical action required.",
    "Treatment": "Maintain cultural practices such as regular watering, proper fertilization, and pruning.",
    "Treatment_Timing": "N/A",
    "Prevention": "Continue regular maintenance and monitoring. Use crop rotation and companion planting to prevent potential issues.",
    "Monitoring": "Conduct regular checks for any signs of disease or pest activity. Maintain a healthy environment by removing weeds and keeping the field clean.",
    "Cultural_Practices": "Practice crop rotation and proper spacing to reduce disease risk.",
    "Physical_Controls": "Use mulching to retain soil moisture and suppress weeds.",
    "Biological_Controls": "Encourage beneficial insects and soil organisms to support plant health."
  },
  "Raspberry___healthy": {
    "Description": "No visible signs of disease or pest damage.",
    "Diagnosis": "Plant is healthy with no visible signs of disease or pest damage.",
    "Recommended_Action": "No chemical action required.",
    "Treatment": "Maintain cultural practices such as regular watering, proper fertilization, and pruning.",
    "Treatment_Timing": "N/A",
    "Prevention": "Continue regular maintenance and monitoring. Use crop rotation and companion planting to prevent potential issues.",
    "Monitoring": "Conduct regular checks for any signs of disease or pest activity. Maintain a healthy environment by removing weeds and keeping the field clean.",
    "Cultural_Practices": "Practice crop rotation and proper spacing to reduce disease risk.",
    "Physical_Controls": "Use mulching to retain soil moisture and suppress weeds.",
    "Biological_Controls": "Encourage beneficial insects and soil organisms to support plant health."
  },
  "Soybean___healthy": {
    "Description": "No visible signs of disease or pest damage.",
    "Diagnosis": "Plant is healthy with no visible signs of disease or pest damage.",
    "Recommended_Action": "No chemical action required.",
    "Treatment": "Maintain cultural practices such as regular watering, proper fertilization, and pruning.",
    "Treatment_Timing": "N/A",
    "Prevention": "Continue regular maintenance and monitoring. Use crop rotation and companion planting to prevent potential issues.",
    "Monitoring": "Conduct regular checks for any signs of disease or pest activity. Maintain a healthy environment by removing weeds and keeping the field clean.",
    "Cultural_Practices": "Practice crop rotation and proper spacing to reduce disease risk.",
    "Physical_Controls": "Use mulching to retain soil moisture and suppress weeds.",
    "Biological_Controls": "Encourage beneficial insects and soil organisms to support plant health."
  },
  "Squash___Powdery_mildew": {
    "Description": "A fungal disease that causes white, powdery spots on squash leaves and stems.",
    "Diagnosis": "White, powdery spots on leaves and stems, leading to leaf yellowing and distortion.",
    "Recommended_Action": "Apply fungicides if necessary, particularly during humid weather.",
    "Treatment": "Fungicides such as sulfur or potassium bicarbonate.",
    "Treatment_Timing": "Apply at the first sign of disease and continue as needed during humid conditions.",
    "Prevention": "Improve air circulation and avoid overhead watering.",
    "Monitoring": "Regularly inspect leaves, particularly in humid conditions, for early signs of powdery mildew.",
    "Cultural_Practices": "Plant resistant varieties and ensure proper spacing for air circulation.",
    "Physical_Controls": "Remove and destroy infected leaves to prevent the spread of spores.",
    "Biological_Controls": "Introduce beneficial fungi like Trichoderma species that help control powdery mildew."
  },
  "Strawberry___Leaf_scorch": {
    "Description": "A fungal disease that causes reddish-brown spots on strawberry leaves, leading to leaf blight and reduced yields.",
    "Diagnosis": "Reddish-brown spots on leaves, often with a purple halo, leading to leaf blight.",
    "Recommended_Action": "Apply fungicides if necessary, particularly during wet weather.",
    "Treatment": "Fungicides such as myclobutanil or copper-based products.",
    "Treatment_Timing": "Apply at the first sign of disease and continue during wet conditions.",
    "Prevention": "Plant resistant varieties and practice crop rotation.",
    "Monitoring": "Inspect strawberry plants regularly for early signs of leaf scorch, especially in wet weather.",
    "Cultural_Practices": "Ensure proper spacing and avoid overhead watering to reduce disease risk.",
    "Physical_Controls": "Remove infected leaves and destroy them to prevent the spread of spores.",
    "Biological_Controls": "Introduce beneficial microorganisms that can outcompete the leaf scorch pathogen."
  },
  "Strawberry___healthy": {
    "Description": "No visible signs of disease or pest damage.",
    "Diagnosis": "Plant is healthy with no visible signs of disease or pest damage.",
    "Recommended_Action": "No chemical action required.",
    "Treatment": "Maintain cultural practices such as regular watering, proper fertilization, and pruning.",
    "Treatment_Timing": "N/A",
    "Prevention": "Continue regular maintenance and monitoring. Use crop rotation and companion planting to prevent potential issues.",
    "Monitoring": "Conduct regular checks for any signs of disease or pest activity. Maintain a healthy environment by removing weeds and keeping the field clean.",
    "Cultural_Practices": "Practice crop rotation and proper spacing to reduce disease risk.",
    "Physical_Controls": "Use mulching to retain soil moisture and suppress weeds.",
    "Biological_Controls": "Encourage beneficial insects and soil organisms to support plant health."
  },
  "Tomato___Bacterial_spot": {
    "Description": "A bacterial disease that causes dark, water-soaked spots on tomato leaves and fruit, leading to leaf blight and fruit lesions.",
    "Diagnosis": "Dark, water-soaked spots on leaves and fruit, often with a yellow halo.",
    "Recommended_Action": "Apply copper-based bactericides and avoid overhead watering.",
    "Treatment": "Copper-based bactericides or antibiotics like streptomycin.",
    "Treatment_Timing": "Apply during early stages of infection, particularly during wet weather.",
    "Prevention": "Plant resistant varieties and practice crop rotation.",
    "Monitoring": "Inspect tomato plants regularly for early signs of bacterial spot, especially after rainy periods.",
    "Cultural_Practices": "Practice good garden sanitation by removing infected leaves and fruit.",
    "Physical_Controls": "Remove and destroy infected plant material to prevent the spread of bacteria.",
    "Biological_Controls": "Introduce beneficial bacteria that can outcompete the bacterial spot pathogen."
  },
  "Tomato___Early_blight": {
    "Description": "A fungal disease that causes dark, concentric spots on tomato leaves, leading to leaf blight and reduced yields.",
    "Diagnosis": "Dark, concentric spots on older leaves, leading to leaf blight.",
    "Recommended_Action": "Apply fungicides if necessary, especially during wet weather.",
    "Treatment": "Fungicides such as chlorothalonil or mancozeb.",
    "Treatment_Timing": "Apply at the first sign of disease and continue during wet conditions.",
    "Prevention": "Plant resistant varieties and practice crop rotation.",
    "Monitoring": "Inspect tomato plants regularly for early signs of blight, especially in wet weather.",
    "Cultural_Practices": "Practice crop rotation and proper spacing to reduce disease risk.",
    "Physical_Controls": "Remove and destroy infected leaves to prevent the spread of spores.",
    "Biological_Controls": "Introduce beneficial fungi like Trichoderma species to help control blight."
  },
  "Tomato___Late_blight": {
    "Description": "A serious fungal disease that causes dark, water-soaked lesions on tomato leaves and fruit, leading to rapid plant death.",
    "Diagnosis": "Dark, water-soaked lesions on leaves and fruit, often with a white fungal growth on the undersides of leaves.",
    "Recommended_Action": "Apply fungicides immediately if blight is detected.",
    "Treatment": "Fungicides such as mancozeb or chlorothalonil.",
    "Treatment_Timing": "Apply at the first sign of disease and continue during wet weather.",
    "Prevention": "Plant resistant varieties and ensure good drainage.",
    "Monitoring": "Regularly inspect tomato plants, especially after wet weather, for signs of late blight.",
    "Cultural_Practices": "Plant resistant varieties and practice crop rotation to reduce disease pressure.",
    "Physical_Controls": "Remove and destroy infected plants to prevent the spread of the disease.",
    "Biological_Controls": "Use beneficial microorganisms like Bacillus subtilis to help control blight."
  },
  "Tomato___Leaf_Mold": {
    "Description": "A fungal disease that causes olive-green mold on tomato leaves, leading to leaf blight and reduced yields.",
    "Diagnosis": "Olive-green mold on the undersides of leaves, leading to leaf yellowing and drop.",
    "Recommended_Action": "Apply fungicides as needed, particularly during humid conditions.",
    "Treatment": "Fungicides such as chlorothalonil or copper-based products.",
    "Treatment_Timing": "Apply at the first sign of disease and continue during humid conditions.",
    "Prevention": "Improve air circulation and avoid overhead watering.",
    "Monitoring": "Inspect tomato plants regularly, especially during humid conditions, for signs of leaf mold.",
    "Cultural_Practices": "Ensure proper spacing and avoid overhead watering to reduce humidity around plants.",
    "Physical_Controls": "Remove and destroy infected leaves to reduce the spread of the disease.",
    "Biological_Controls": "Introduce beneficial fungi or bacteria that compete with the leaf mold pathogen."
  },
  "Tomato___Septoria_leaf_spot": {
    "Description": "A fungal disease that causes small, dark spots with concentric rings on tomato leaves, leading to leaf drop and reduced yields.",
    "Diagnosis": "Small, dark spots with concentric rings on leaves, leading to leaf drop.",
    "Recommended_Action": "Apply fungicides as needed, especially during wet weather.",
    "Treatment": "Fungicides such as chlorothalonil or copper-based products.",
    "Treatment_Timing": "Apply at the first sign of disease and continue during wet conditions.",
    "Prevention": "Plant resistant varieties and practice crop rotation.",
    "Monitoring": "Inspect tomato plants regularly for early signs of septoria leaf spot, especially after wet weather.",
    "Cultural_Practices": "Practice crop rotation and ensure proper spacing to reduce disease risk.",
    "Physical_Controls": "Remove and destroy infected leaves to prevent the spread of the disease.",
    "Biological_Controls": "Use beneficial microorganisms to help control the fungal pathogen."
  },
  "Tomato___Spider_mites_Two-spotted_spider_mite": {
    "Description": "A pest infestation that causes stippling and yellowing of tomato leaves, often leading to leaf drop and reduced yields.",
    "Diagnosis": "Stippling and yellowing of leaves, often with webbing on the undersides.",
    "Recommended_Action": "Apply miticides or insecticidal soaps to control mite populations.",
    "Treatment": "Miticides or insecticidal soaps.",
    "Treatment_Timing": "Apply at the first sign of mite infestation and repeat as needed.",
    "Prevention": "Maintain good plant health and avoid excessive use of nitrogen fertilizers.",
    "Monitoring": "Inspect leaves regularly for signs of mite damage and webbing.",
    "Cultural_Practices": "Maintain plant health and use predatory mites to control spider mite populations.",
    "Physical_Controls": "Use water sprays to dislodge mites from plants.",
    "Biological_Controls": "Introduce predatory mites or other beneficial insects that feed on spider mites."
  },
  "Tomato___Target_Spot": {
    "Description": "A fungal disease that causes dark, sunken spots with concentric rings on tomato leaves, leading to leaf blight.",
    "Diagnosis": "Dark, sunken spots with concentric rings on leaves, leading to leaf blight.",
    "Recommended_Action": "Apply fungicides if necessary, particularly during wet conditions.",
    "Treatment": "Fungicides such as chlorothalonil or copper-based products.",
    "Treatment_Timing": "Apply at the first sign of disease and continue during wet conditions.",
    "Prevention": "Practice crop rotation and ensure proper spacing between plants.",
    "Monitoring": "Regularly inspect tomato plants for early signs of target spot, especially in humid conditions.",
    "Cultural_Practices": "Practice crop rotation and ensure good air circulation around plants.",
    "Physical_Controls": "Remove and destroy infected leaves to prevent the spread of the disease.",
    "Biological_Controls": "Introduce beneficial fungi or bacteria to help control the target spot pathogen."
  },
  "Tomato___Tomato_Yellow_Leaf_Curl_Virus": {
    "Description": "A viral disease transmitted by whiteflies that causes yellowing and curling of tomato leaves.",
    "Diagnosis": "Yellowing and curling of leaves, often with stunted plant growth.",
    "Recommended_Action": "Remove and destroy infected plants. Control whitefly populations with insecticides or reflective mulches.",
    "Treatment": "No chemical treatments for the virus itself; manage whitefly populations.",
    "Treatment_Timing": "N/A",
    "Prevention": "Use resistant tomato varieties and control whitefly populations.",
    "Monitoring": "Inspect plants regularly for signs of yellowing and curling. Monitor for whiteflies.",
    "Cultural_Practices": "Use resistant varieties and manage whitefly populations using insecticides or reflective mulches.",
    "Physical_Controls": "Remove and destroy infected plants to prevent the spread of the virus.",
    "Biological_Controls": "Encourage natural predators of whiteflies, such as lacewings or parasitic wasps."
  },
  "Tomato___Tomato_mosaic_virus": {
    "Description": "A viral disease that causes mottling and distortion of tomato leaves and fruit.",
    "Diagnosis": "Mottling and distortion of leaves and fruit.",
    "Recommended_Action": "Remove and destroy infected plants. Use resistant varieties and control aphid populations.",
    "Treatment": "No chemical treatments for the virus itself; manage aphid populations.",
    "Treatment_Timing": "N/A",
    "Prevention": "Use resistant tomato varieties and control aphid populations.",
    "Monitoring": "Inspect plants regularly for signs of mottling and distortion. Monitor for aphids.",
    "Cultural_Practices": "Use resistant varieties and manage aphid populations using insecticides.",
    "Physical_Controls": "Remove and destroy infected plants to prevent the spread of the virus.",
    "Biological_Controls": "Encourage natural predators of aphids, such as ladybugs or lacewings."
  },
  "Tomato___healthy": {
    "Description": "No visible signs of disease or pest damage.",
    "Diagnosis": "Plant is healthy with no visible signs of disease or pest damage.",
    "Recommended_Action": "No chemical action required.",
    "Treatment": "Maintain cultural practices such as regular watering, proper fertilization, and pruning.",
    "Treatment_Timing": "N/A",
    "Prevention": "Continue regular maintenance and monitoring. Use crop rotation and companion planting to prevent potential issues.",
    "Monitoring": "Conduct regular checks for any signs of disease or pest activity. Maintain a healthy environment by removing weeds and keeping the field clean.",
    "Cultural_Practices": "Practice crop rotation and proper spacing to reduce disease risk.",
    "Physical_Controls": "Use mulching to retain soil moisture and suppress weeds.",
    "Biological_Controls": "Encourage beneficial insects and soil organisms to support plant health."
  }
}
